# PenGrid

## Description
Procedure PenGrid sets the snap grid distance in the document.

```pascal
PROCEDURE PenGrid(gridDistance : REAL);
```

```python
def vs.PenGrid(gridDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|gridDistance|REAL|Pen grid spacing.|

## Version
Availability: from All Versions

## Category
* Document Settings